Repository: 84000/data-translation-memory
Catalog: toh551-v3.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་མཁྱེན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: The Blessed One’s Praise of Sharp Mañjuśrī Homage to the Omniscient One!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་རྣོན་པོ་ལ་བསྟོད་པ། མཐིང་ནག་མཛེས་པས་འཇམ་པར་འཚེར་བའི་དབུ།
en: The Blessed One praised sharp Mañjuśrī: Your head shines gently with the beauty of midnight splendor.

source: །ལྕང་ལོ་རྫིངས་བསྐྱོད་མཐིང་གི་མཚོ་ལྟར་གཡོ།
en: Your braids sway like a boat amid azure ocean waves.

source: །དགེ་བའི་སྤྱི་གཙུག་མཚན་མཆོག་གཡས་སུ་འཁྱིལ། །གཙུག་ཏོར་འཕགས་པས་སྐྱེ་བོས་བལྟར་མི་མཐོང་།
en: At the noble crown of your head, the supreme mark, coiled to the right— An uṣṇīṣa lofty beyond the sight of ordinary beings.

source: །སྲིད་པའི་སྡུག་བསྔལ་མ་ལུས་གཞོམ་པ་དང་། །མཐུ་ཆེན་བྱིན་གྱིས་རྒོལ་བ་གཞོམ་པའི་ཕྱིར། །དབུ་རྒྱན་ཅོད་པན་རྒྱལ་བའི་མཆོག་གསང་ཞིང་། །ཆོས་ཀྱི་རྒྱལ་ཐབས་དབང་གི་ཕ་རོལ་ཕྱིན།
en: That all suffering of existence be overcome And your brilliant powers vanquish the enemy, The crown upon your head conceals a conqueror’s excellence; Your perfections of might and skill are those of a dharmarāja.

source: །རིན་ཆེན་སྤུག་དང་ཨུཏྤལ་འདྲ་བ་ཡི། །ཤིན་ཏུ་དངས་པར་དཀར་ནག་ཕྱེད་པའི་སྤྱན།
en: As in cat’s-eye gems and water lilies, so in your eyes, White and black are distinguished with perfect clarity.

source: །སྨིན་ཚུགས་མཛེས་པས་ཟླ་བ་ཚེས་ལྟར་འཁྱུག །མིག་འཛུམས་ཟུར་གྱིས་ལྟ་བས་བྱམས་པའི་རྟགས།
en: Your elegant eyebrows glisten like crescent moons, And the sidelong glances of your smiling eyes signal your affection.

source: །སིལ་སྙན་རྣམ་དག་མཚན་རབ་འབྲུ་ཆགས་པ། །རིན་ཆེན་མ་ལུས་རྣམ་པ་དུ་མས་སྤྲས། །རྒྱལ་བས་ཞིང་མང་རྣམ་པ་སྣ་ཚོགས་སུ། །རྣམ་ཐར་དཔག་ཡས་ཆོས་སྒོ་གྲངས་མེད་གནས།
en: You are the foundation of countless Dharma gates to limitless liberation, In the sundry plethora of the victors’ fields, Embellished by pure music, excellent qualities, ample grain, And jewels of every type.

source: །ཤངས་ཀྱི་དབྱིབས་ལེགས་སྐྱེ་བོ་ཡོངས་ལས་འཕགས། །མཐོ་ལ་ཡིད་ཙམ་ཟུར་ལ་ལེགས་པའི་མཚན། །དྲང་ལ་ཆུ་ཕྲན་འདྲ་བར་མཛེས་པའི་ཚུལ།
en: The beautiful form of your nose is noblest of all— Highly ridged, with corners slight, and elegant of shape, Finely channeled like a slender stream.

source: །བཟང་ལེགས་བསྐལ་པ་བརྒྱར་ཡང་བལྟར་མི་ངོམས།
en: One will not tire of gazing upon its virtues even in a hundred eons.

source: །པདྨ་ལེ་བརྒན་ཚོན་ལྟར་དམར་བའི་སྒྲོས། །ཡིད་གཞུངས་སེལ་བ་འཁྱིལ་བ་བཟང་ལེགས་སྐུ། །མདོག་སྡུག་ཚུ་སྐྱེས་སྣང་བ་མཚོ་ལོ་བཞིན། །ཤིན་ཏུ་དང་པའི་ཡིད་ཀྱིས་འཛུམ་པ་མཛད།
en: Your lips, the red of a mañjiṣṭhā flower, Your exquisite body, perfectly formed, quelling deluded thought, Your lovely complexion, radiant as a lotus, clear as a lake, And the lucidity of your mind—all give reason to smile.

source: །ཞལ་རས་ཟླ་འདྲ་གསེར་གྱི་མདོག་གིས་རྒྱས། །འོད་ཀྱི་དཀྱིལ་འཁོར་གསེར་ཕྲེང་དུ་མས་སྤྲས། །གསལ་བའི་འོད་ཕུང་ཉི་མ་བརྒྱ་བས་ལྷག །འོད་ཟེར་སྣ་ཚོགས་སྤྲིན་ཕུང་བཞིན་དུ་འཕྲོ།
en: Your moon-like countenance is golden and effulgent, A maṇḍala of light resplendent with golden garlands, An orb of pure light to outshine a hundred suns, Emitting many colors like a mass of clouds.

source: །ཆོས་དབྱིངས་འཇམ་པའི་དབྱངས་ཀྱིས་སྒྲ་སྒྲོགས་པ། །ཀ་ལ་པིང་ཀ་ལྟ་བུར་ཡིད་འཕྲོག་མཛད།
en: O Gentle Voice, the dharmadhātu you proclaim— Alluring as the song of the kalaviṅka bird.

source: །སང་སང་དབྱངས་རབ་གསུང་དབྱངས་རབ་བསྒྲགས་པ། །སེང་གེའི་ང་རོ་གསེར་གྱི་དྲིལ་ལྟར་འཁྲོལ།
en: Your voice, perfect, pristine, and melodious, Roars like a lion and chimes like a golden bell.

source: །སྐྱེས་མཆོག་མཛད་པ་རྒམ་པར་མཛད་པའི་སྐུ། །ཆ་ལུགས་བཞིན་འཆང་གཟི་བརྗིད་འཕགས་པའི་སྐྲུ།
en: The body that you cultivate—a body cloaked in noble splendor— Performs the deeds of the most excellent of beings.

source: །གཞོན་ནུའི་ཚུལ་ཆགས་ཤིན་ཏུ་གཞོན་པར་གདའ། །གདུལ་བྱའི་སྐྱེ་བོ་གཞོན་ནུའི་གཟུགས་ཀྱིས་གདུལ།
en: It is youthful in appearance and youthful in bearing, A youthful form that trains the ready.

source: །དབུ་རྒྱན་རིན་ཆེན་རྣམ་པ་སྣ་ཚོགས་དང་། །མུ་ཏིག་དོ་ཤལ་གསེར་གྱི་རྒྱན་དུ་བཀོད།
en: You wear a crown replete with many jewels; Pearls are embedded in your golden necklace.

source: །པདྨ་ལྷ་ཡི་ན་བཟའ་སིལ་མ་བསྣམས།
en: Layered garments, a divine lotus, envelop you.

source: །གཡས་ན་མཚོན་མཆོག་བསྣམས་པ་ཐབས་ཀྱིས་འདུལ། །དཔེ་མེད་རྣོ་བ་ཤེས་རབ་ཉིད་དུ་ངེས། །ཆོས་དབྱིངས་ཚུལ་ཉིད་ཡང་དག་བརྗོད་པ་དང་། །མི་ཤིགས་རྡོ་རྗེ་གཏན་ནས་འབིགས་པའི་ཚུལ།
en: In your right you brandish the finest weapon, which tames through skillful means— It is insight itself, incomparably keen, Perfectly expressing the dharmadhātu principle, Incisive in manner, unbreakable as vajra.

source: །གཡོན་པ་ཤེས་རབ་ཕ་རོལ་ཕྱིན་པ་དང་། །བླང་དོར་གཉིས་མེད་བསམ་གྱིས་མི་ཁྱབ་དབྱིངས། །ཟབ་མོའི་ཆོས་ཉིད་ཐུགས་སུ་ཆུད་པའི་དོན།
en: In your left is the Perfection of Wisdom, The inconceivable sphere where nothing is cultivated nor cast aside— Such is the fathomless dharmatā, The truth you embrace in your heart.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་རྣོན་པོ་ལ་བསྟོད་པ་རྫོགས་སོ།། །།
en: This concludes “The Blessed One’s Praise of Sharp Mañjuśrī.”
